app/Controllers/admin_controller.php

SELECT *
FROM `usuarios`
---
    public function index()
    {
        $session = session();
        if ($session->perfil_id != 1) {
            return redirect()->to('/panel');
        }

        $model = new usuario_Model();
        $data['usuarios'] = $model->findAll();

UPDATE `usuarios` SET `nombre` = 'Edu', `apellido` = 'Fontora', `email` = 'eduar@correo.com', `usuario` = 'edu12345', `perfil_id` = NULL, `baja` = NULL
WHERE `usuarios`.`id_usuario` IN ('2')
---
    public function actualizar()
    {
        $model = new usuario_Model();
        $id = $this->request->getPost('id_usuario');

        $data = [
            'nombre'    => $this->request->getPost('nombre'),
            'apellido'  => $this->request->getPost('apellido'),
            'email'     => $this->request->getPost('email'),
            'usuario'   => $this->request->getPost('usuario'),
            'perfil_id' => $this->request->getPost('perfil_id'),
            'baja'      => $this->request->getPost('baja')
        ];

        $model->update($id, $data);