app/Controllers/usuario_controller.php

INSERT INTO `usuarios` (`nombre`, `apellido`, `email`, `usuario`, `pass`) VALUES ('esperanza', 'gomez', 'esperan@correo.com', 'espera123', '$2y$10$MdJN9nCNk3XsPhmzv7Z/3uQKz1RwCvTi2DRwKHQ4RFTsIBRu6Em0S')
---
    public function formValidation(){

        $input = $this->validate([
            'nombre' => 'required|min_length[3]',
            'apellido' => 'required|min_length[3]|max_length[25]',
            'usuario' => 'required|min_length[3]',
            'email' =>   'required|min_length[4]|max_length[100]|valid_email|is_unique[usuarios.email]',
            'pass' => 'required|min_length[3]|max_length[10]'

        ],

    );
     $formModel = new Usuarios_model();

        if(!input) {
            $data['titulo']='Registro';
             echo view('front/head_view',$dato);
             echo view('front/nav_view');
             echo view('back/usuario/registro', ['validation' => $this->validator]);
             echo view('front/footer_view');

        } else{
            $formModel->save([
                'nombre' => $this->request->getVar('nombre'),
                'apellido' => $this->request->getVar('apellido'),
                'usuario' => $this->request->getVar('usuario'),
                'email' => $this->request->getVar('email'),
                'pass' => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT),

                //password_hash() crea un nuevo hash de contraseña usando un algoritmo de hash de único sentido
            ]);